---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamCutOverallLength
source: html/89a8f1d5-0468-b276-b44e-da40549329d8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamCutOverallLength Property

"Cut Overall Length": Provides a real sheet Length after definition

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamCutOverallLength { get; }
```